views/tipos/_form.php

SELECT * FROM `tipo`
---

    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'tipoid_fk')->dropDownList(ArrayHelper::map(Tipo::find()->all(),'tipoid','tipodesc'), ['prompt'=> 'Seleccione el Tipo']) ?>