views/tipos/index.php

        <?= Html::a(Yii::t('app', 'Create Tipos'), ['create'], ['class' => 'btn btn-success']) ?>
    </p>

    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'tiposid',
            [   'header' => 'Tipo',
                'headerOptions' => ['style' => 'color:#337ab7'],
                'value'=> function($model){
                    return $model->Tipo();
                },
                 'filter'=>
                Html::activeDropDownList($searchModel, 'tipoid_fk', ArrayHelper::map(Tipo::find()->all(),'tipoid','tipodesc'),
                [ 'prompt'=>'Seleccione Tipo',])
            ],
            'tiposdesc',
            'tiposvalor',

            ['class' => 'yii\grid\ActionColumn'],
        ],
    ]); ?>
---
SELECT COUNT(*) FROM `tipos`
SELECT * FROM `tipos` LIMIT 20