views/usuarios/_form.php

SELECT * FROM `tipos` WHERE tipoid_fk = 1
---
    <?= $form->field($model, 'usuteleofic')->textInput(['maxlength' => true]) ?>

    <?php
        $consulta = Tipos::find()->asArray()->where('tiposid_fk = 1')->all();

SELECT * FROM `tipos` WHERE tipoid_fk = 1
---
    <?= $form->field($model, 'usucorr')->textInput(['maxlength' => true]) ?>

    <?php
        $consulta = Tipos::find()->asArray()->where('tiposid_fk = 2')->all();

SELECT * FROM `dependencias`
---
    <?= $form->field($model, 'usucont')->textInput(['maxlength' => true]) ?>

    <?php
        $consulta = Dependencias::find()->asArray()->all();

SELECT * FROM `roles`
---
    ?>

    <?php
        $consulta = Roles::find()->asArray()->all();