controllers/TiposController.php

INSERT INTO `tipos` (`tipoid_fk`, `tiposdesc`, `tiposvalor`) VALUES (2, 'Habilitado', 0)
SELECT EXISTS(SELECT * FROM `tipo` WHERE `tipo`.`tipoid`='2')
---
    public function actionCreate()
    {
        $model = new Tipos();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `tipos` WHERE `tiposid`='3'
---
    protected function findModel($id)
    {
        if (($model = Tipos::findOne($id)) !== null) {