controllers/TipoController.php

INSERT INTO `tipo` (`tipodesc`) VALUES ('Cargo de Usuario')
---
    public function actionCreate()
    {
        $model = new Tipo();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `tipo` WHERE `tipoid`='1'
---
    protected function findModel($id)
    {
        if (($model = Tipo::findOne($id)) !== null) {